Documents/РаспределениеРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РаспределениеРасходовНаПерсонал</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФинансовыйУчетРаспределениеРасходовНаПерсонал</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяДоляСтоПроцентов</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпособыОтраженияВФинансовомУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияВФинансовомУчете</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КатегорииСтатейРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РаспределениеРасходовНаПерсонал/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА))";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ЗагрузкаДанныхИзФайла

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
// 
// Параметры:
//  АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                                       находятся загруженные данные из файла.
//  АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                                       являющейся копией табличной части документа, 
//                                       которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//  СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов:
//   * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//   * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//  ПолноеИмяТабличнойЧасти - Строка - полное имя табличной части, в которую загружаются данные.
//  ДополнительныеПараметры - Произвольный - Любые дополнительные сведения.
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ЗагружаемыеДанные    = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений - 
	ТаблицаСопоставления = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений - 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЗагружаемыеДанные", ЗагружаемыеДанные);
	
	МассивЗапросов = Новый Массив;
	МассивЗапросов.Добавить(ТекстЗапросаЗагружаемыхДанных(ЗагружаемыеДанные.Колонки));
	МассивЗапросов.Добавить(ТекстЗапросаСопоставленияДанных(ЗагружаемыеДанные.Колонки));
	МассивЗапросов.Добавить(ТекстЗапросаВыборкиСопоставленныхДанных());
	
	Запрос.Текст = СтрСоединить(МассивЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаСопоставления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.КоличествоСотрудников > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = Выборка.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "СотрудникФИО";
		КонецЕсли;
		
		Если Выборка.КоличествоСпособовОтражения > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = Выборка.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "СпособОтражения";
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
//
// Параметры:
//   ПолноеИмяТабличнойЧасти   - Строка - Полное имя табличной части, в которую загружаются данные.
//   СписокНеоднозначностей    - Массив - Массив для заполнения с неоднозначными данными.
//   ИмяКолонки                - Строка - Имя колонки, в который возникла неоднозначность. 
//   ЗагружаемыеЗначенияСтрока - Строка - Загружаемые данные, на основании которых возникла неоднозначность.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "Сотрудник" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ Ссылка
		|ИЗ Справочник.Сотрудники
		|ГДЕ Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.СотрудникФИО);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИмяКолонки = "СпособОтражения" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ Ссылка
		|ИЗ Справочник.СпособыОтраженияВФинансовомУчете
		|ГДЕ Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.СпособОтражения);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.РаспределениеРасходовНаПерсонал;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция ОписаниеКолонокМакетаДляЗагрузкиИзФайла() Экспорт
	
	КолонкиМакета = Новый Массив;
	
	Группа = НСтр("ru = 'Сотрудник'");
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
		"СотрудникКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	Колонка.Заголовок = НСтр("ru = 'Код'");
	Колонка.Группа = Группа;
	Колонка.Ширина = 10;
	Колонка.Родитель = "Сотрудник";
	Колонка.Позиция = КолонкиМакета.Количество() + 1;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
		"СотрудникФИО", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	Колонка.Заголовок = НСтр("ru = 'ФИО'");
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Группа = Группа;
	Колонка.Родитель = "Сотрудник";
	Колонка.Позиция = КолонкиМакета.Количество() + 1;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
		"СпособОтражения", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	Колонка.Заголовок = НСтр("ru = 'Способ отражения'");
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Позиция = КолонкиМакета.Количество() + 1;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
		"ДоляРаспределения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла()));
	Колонка.Заголовок = НСтр("ru = 'Доля распределения'");
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Ширина = 15;
	Колонка.Позиция = КолонкиМакета.Количество() + 1;
	КолонкиМакета.Добавить(Колонка);
	
	Возврат КолонкиМакета;
	
КонецФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента) Экспорт
	
	ЗарплатаКадры.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента, "ДатаНачала");
	
КонецПроцедуры

#Область ЗагрузкаДанныхИзФайла

Функция ТекстЗапросаЗагружаемыхДанных(Колонки)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ЗагружаемыеДанные
	|ИЗ &ЗагружаемыеДанные КАК Таблица";
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Запрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	Для Каждого Колонка Из Колонки Цикл
		Если Колонка.Имя = "Идентификатор" Тогда
			Продолжить;
		КонецЕсли;
		Запрос.ВыбираемыеПоля.Добавить("Таблица." + Колонка.Имя);
	КонецЦикла;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСопоставленияДанных(Колонки)
	
	МассивЗапросов = Новый Массив;
	
	Если Колонки.Найти("СотрудникФИО") = Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Ссылка,
		|	0 КАК ИдентификаторСтроки,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ СотрудникиСопоставленные";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	ЗагружаемыеДанные.Идентификатор КАК ИдентификаторСтроки,
		|	2 КАК Приоритет
		|ПОМЕСТИТЬ СотрудникиСопоставленные
		|ИЗ Справочник.Сотрудники КАК Сотрудники
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗагружаемыеДанные КАК ЗагружаемыеДанные
		|		ПО Сотрудники.Код = ЗагружаемыеДанные.СотрудникКод
		|			И Сотрудники.Наименование = ЗагружаемыеДанные.СотрудникФИО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		|	ЗагружаемыеДанные.Идентификатор,
		|	1
		|ИЗ Справочник.Сотрудники КАК Сотрудники
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗагружаемыеДанные КАК ЗагружаемыеДанные
		|		ПО Сотрудники.Наименование = ЗагружаемыеДанные.СотрудникФИО
		|			И ЗагружаемыеДанные.СотрудникКод = """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторСтроки";
	КонецЕсли;
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	Если Колонки.Найти("СпособОтражения") = Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка) КАК Ссылка,
		|	0 КАК ИдентификаторСтроки,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ СпособыОтраженияСопоставленные";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СпособыОтражения.Ссылка КАК Ссылка,
		|	ЗагружаемыеДанные.Идентификатор КАК ИдентификаторСтроки,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ СпособыОтраженияСопоставленные
		|ИЗ Справочник.СпособыОтраженияВФинансовомУчете КАК СпособыОтражения
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗагружаемыеДанные КАК ЗагружаемыеДанные
		|		ПО СпособыОтражения.Наименование = ЗагружаемыеДанные.СпособОтражения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторСтроки";
	КонецЕсли;
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(ЕСТЬNULL(Сотрудники.Приоритет, 0)) КАК ПриоритетСотрудников,
	|	МАКСИМУМ(ЕСТЬNULL(СпособыОтражения.Приоритет, 0)) КАК ПриоритетСпособовОтражения
	|ПОМЕСТИТЬ ПриоритетыСопоставления
	|ИЗ ЗагружаемыеДанные КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ СотрудникиСопоставленные КАК Сотрудники
	|		ПО Таблица.Идентификатор = Сотрудники.ИдентификаторСтроки
	|	ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияСопоставленные КАК СпособыОтражения
	|		ПО Таблица.Идентификатор = СпособыОтражения.ИдентификаторСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Идентификатор
	|;
	|
	|ВЫБРАТЬ
	|	Таблица.Идентификатор КАК ИдентификаторСтроки,
	|	МАКСИМУМ(Сотрудники.Ссылка) КАК Сотрудник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК КоличествоСотрудников,
	|	МАКСИМУМ(СпособыОтражения.Ссылка) КАК СпособОтражения,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпособыОтражения.Ссылка) КАК КоличествоСпособовОтражения
	|ПОМЕСТИТЬ СопоставленныеДанные
	|ИЗ ПриоритетыСопоставления КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ СотрудникиСопоставленные КАК Сотрудники
	|		ПО Таблица.Идентификатор = Сотрудники.ИдентификаторСтроки
	|		И Таблица.ПриоритетСотрудников = Сотрудники.Приоритет
	|	ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияСопоставленные КАК СпособыОтражения
	|		ПО Таблица.Идентификатор = СпособыОтражения.ИдентификаторСтроки
	|		И Таблица.ПриоритетСпособовОтражения = СпособыОтражения.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Идентификатор";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"УНИЧТОЖИТЬ ПриоритетыСопоставления;
	|УНИЧТОЖИТЬ СотрудникиСопоставленные;
	|УНИЧТОЖИТЬ СпособыОтраженияСопоставленные";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	Возврат СтрСоединить(МассивЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Функция ТекстЗапросаВыборкиСопоставленныхДанных()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СопоставленныеДанные.КоличествоСотрудников = 1
	|			ТОГДА СопоставленныеДанные.Сотрудник
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА СопоставленныеДанные.КоличествоСпособовОтражения = 1
	|			ТОГДА СопоставленныеДанные.СпособОтражения
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СпособОтражения,
	|	СопоставленныеДанные.КоличествоСотрудников КАК КоличествоСотрудников,
	|	СопоставленныеДанные.КоличествоСпособовОтражения КАК КоличествоСпособовОтражения,
	|	ЗагружаемыеДанные.*
	|ИЗ ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ СопоставленныеДанные КАК СопоставленныеДанные
	|		ПО ЗагружаемыеДанные.Идентификатор = СопоставленныеДанные.ИдентификаторСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаОРаспределенииРасходов";
	КомандаПечати.Представление = НСтр("ru = 'Справка о регистрации распределения'");
	КомандаПечати.МенеджерПечати = "Документ.РаспределениеРасходовНаПерсонал";
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОРаспределенииРасходов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПФ_MXL_СправкаОРаспределенииРасходов",
			НСтр("ru = 'Справка о регистрации распределения расходов на персонал'"),
			ПечатьСправкиОРаспределенииРасходов(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.РаспределениеРасходовНаПерсонал.ПФ_MXL_СправкаОРаспределенииРасходов");
			
	КонецЕсли;
						
КонецПроцедуры

Функция ПечатьСправкиОРаспределенииРасходов(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РаспределениеРасходовНаПерсонал_СправкаОРаспределенииРасходов";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РаспределениеРасходовНаПерсонал.ПФ_MXL_СправкаОРаспределенииРасходов");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПодбираетсяАвтоматически", НСтр("ru = '<подбирается автоматически>'"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Ссылка.Подразделение КАК Подразделение,
	|	Сотрудники.Ссылка.ДатаНачала КАК ДатаНачала,
	|	Сотрудники.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	Сотрудники.Ссылка.Ответственный КАК Ответственный,
	|	Сотрудники.Ссылка.СуммарнаяДоляСтоПроцентов КАК СуммарнаяДоляСтоПроцентов,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	СтрокиРаспределения.СпособОтражения КАК СпособОтражения,
	|	СтрокиРаспределения.ДоляРаспределения КАК ДоляРаспределения,
	|	Сотрудники.Ссылка.Дата КАК Дата,
	|	Сотрудники.Ссылка.Номер КАК Номер,
	|	Сотрудники.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Сотрудники.НомерСтроки КАК НомерСтроки,
	|	СтрокиРаспределения.НомерСтроки КАК НомерСтрокиРаспределения
	|ИЗ
	|	Документ.РаспределениеРасходовНаПерсонал.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовНаПерсонал.РаспределениеРасходов КАК СтрокиРаспределения
	|		ПО Сотрудники.ИдентификаторСтрокиСотрудника = СтрокиРаспределения.ИдентификаторСтрокиСотрудника
	|			И Сотрудники.Ссылка = СтрокиРаспределения.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	НомерСтрокиРаспределения";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрокаСотрудник = Макет.ПолучитьОбласть("СтрокаСотрудник");
	ОбластьСтрокаРаспределение = Макет.ПолучитьОбласть("СтрокаРаспределение");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	ДанныеШапки = Новый Структура("Подразделение,ПериодРегистрации,ДатаДокумента,НомерДокумента");
	ДанныеСтрокаСотрудник = Новый Структура("Номер,Сотрудник,Доля");
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеШапки.Подразделение = Выборка.Подразделение;
		ДанныеШапки.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=D");
		ДанныеШапки.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		
		Если Не ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			ДатаНачала = Формат(Выборка.ДатаНачала, НСтр("ru='ДФ=''ММММ yyyy'''"));
			ДанныеШапки.ПериодРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'с %1 г.'"), СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДатаНачала, 2));
		ИначеЕсли Выборка.ДатаНачала = Выборка.ДатаОкончания Тогда
			ДатаНачала = Формат(Выборка.ДатаНачала, НСтр("ru='ДФ=''ММММ yyyy'''"));
			ДанныеШапки.ПериодРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'в %1 г.'"), СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДатаНачала, 6));
		ИначеЕсли Год(Выборка.ДатаНачала) = Год(Выборка.ДатаОкончания) Тогда
			ДатаНачала = Формат(Выборка.ДатаНачала, НСтр("ru='ДФ=''ММММ'''"));
			ДатаОкончания = Формат(Выборка.ДатаОкончания, НСтр("ru='ДФ=''ММММ yyyy'''"));
			ДанныеШапки.ПериодРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'с %1 по %2 г.'"),
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДатаНачала, 2), ДатаОкончания);
		Иначе
			ДатаНачала = Формат(Выборка.ДатаНачала, НСтр("ru='ДФ=''ММММ yyyy'''"));
			ДатаОкончания = Формат(Выборка.ДатаОкончания, НСтр("ru='ДФ=''ММММ yyyy'''"));
			ДанныеШапки.ПериодРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'с %1 г. по %2 г.'"),
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДатаНачала, 2), ДатаОкончания);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		НомерСтроки = 1;
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			СуммарнаяДоля = 0;
			ДанныеРаспределения = Новый Массив;
			Пока Выборка.Следующий() Цикл
				ДанныеСтрокаРаспределения = Новый Структура("СпособОтражения,Доля");
				ЗаполнитьЗначенияСвойств(ДанныеСтрокаРаспределения, Выборка);
				ДанныеСтрокаРаспределения.Доля = Формат(Выборка.ДоляРаспределения, "ЧЦ=14; ЧДЦ=3");
				ДанныеРаспределения.Добавить(ДанныеСтрокаРаспределения);
				СуммарнаяДоля = СуммарнаяДоля + Выборка.ДоляРаспределения;
			КонецЦикла; 
			
			ДанныеСтрокаСотрудник.Номер = НомерСтроки;
			ДанныеСтрокаСотрудник.Сотрудник = Выборка.Сотрудник;
			ДанныеСтрокаСотрудник.Доля = Формат(СуммарнаяДоля, "ЧЦ=14; ЧДЦ=3");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаСотрудник.Параметры, ДанныеСтрокаСотрудник);
			ТабличныйДокумент.Вывести(ОбластьСтрокаСотрудник);
			
			Для каждого СтрокаРаспределения Из ДанныеРаспределения Цикл
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаРаспределение.Параметры, СтрокаРаспределения);
				ТабличныйДокумент.Вывести(ОбластьСтрокаРаспределение);
			КонецЦикла;
			
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
